#!/usr/bin/env python3.5

print("Входные данные")

number1 = int(input())
number2 = int(input())

print("Выходые данные")
print(number2 // number1)
print(number2 % number1)
