#!/usr/bin/env python3

print("Входные данные")

number1 = int(input())
number2 = int(input())

print("Выходые данные")
print(0.5 * number1 * number2)
